In [1]:
# Importing dependencies
import pandas as pd

In [2]:
# Reading the dataframes
child_mortality = pd.read_csv('Dataset/healthdata/child-mortality.csv')
hiv_deaths = pd.read_csv('Dataset/healthdata/deaths-and-new-cases-of-hiv.csv')
life_expectency = pd.read_csv('Dataset/healthdata/life-expectancy.csv')
population = pd.read_csv('Dataset/healthdata/projected-population-by-country.csv')
heart_disease = pd.read_csv('Dataset/healthdata/share-deaths-heart-disease.csv')
tuberculosis = pd.read_csv('Dataset/healthdata/tuberculosis-deaths-region.csv')

# Cleaning up the dataset

In [3]:
# Child mortality rates
child_mortality1 = child_mortality['Year'].max()
child_mortality1

2016

In [4]:
child_mortality2 = child_mortality[child_mortality['Year']==2016]
child_mortality2

               Entity Code  Year  Child mortality rates (%)
59        Afghanistan  AFG  2016                     7.0400
98            Albania  ALB  2016                     1.3500
161           Algeria  DZA  2016                     2.5200
188           Andorra  AND  2016                     0.2700
225            Angola  AGO  2016                     8.2500
...               ...  ...   ...                        ...
13314         Vietnam  VNM  2016                     2.1600
13317  Western Sahara  ESH  2016                     3.6388
13382           Yemen  YEM  2016                     5.5300
13447          Zambia  ZMB  2016                     6.3400
13511        Zimbabwe  ZWE  2016                     5.6400

[211 rows x 4 columns]

In [5]:
# Hiv Deaths
hiv_deaths.columns

Index(['Entity', 'Code', 'Year', 'Deaths', 'Prevalence', 'Incidences'], dtype='object')

In [6]:
hiv_deaths.head()

        Entity Code  Year     Deaths  Prevalence  Incidences
0  Afghanistan  AFG  1990  32.098129  398.257783   78.304642
1  Afghanistan  AFG  1991  37.524158  438.019845   83.233703
2  Afghanistan  AFG  1992  50.670559  543.250161  104.710195
3  Afghanistan  AFG  1993  58.433049  668.869833  128.605343
4  Afghanistan  AFG  1994  65.531176  735.565331  136.848748

In [7]:
# Obtaining the latest year
hiv_deaths['Year'].max()

2017

In [8]:
hiv_deaths1 = hiv_deaths[hiv_deaths['Year']==2017]
hiv_deaths1

,Entity,Code,Year,Deaths,Prevalence,Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [9]:
hiv_deaths2 = hiv_deaths1.rename(columns={'Deaths':'HIV Deaths', 'Incidences':'HIV Incidences'})
hiv_deaths2

,Entity,Code,Year,HIV Deaths,Prevalence,HIV Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [10]:
# Dropping Columns
hiv_deaths3 = hiv_deaths2.drop(columns=['Prevalence','Code','Year'])
hiv_deaths3

                          Entity     HIV Deaths  HIV Incidences
27                   Afghanistan     302.166880    9.221735e+02
55                       Albania       1.285800    3.030192e+00
83                       Algeria     326.660742    9.008058e+02
111               American Samoa       0.335763    6.577304e-01
139         Andean Latin America    4655.939469    1.238097e+04
...                          ...            ...             ...
6355  Western Sub-Saharan Africa  256899.798300    3.604100e+05
6383                       World  954491.747200    1.942071e+06
6411                       Yemen     387.383175    1.082583e+03
6439                      Zambia   21806.824350    4.683891e+04
6467                    Zimbabwe   16065.329680    5.625906e+04

[231 rows x 3 columns]

In [11]:
# Life Expectency
life_expectency.head()

        Entity Code  Year  Life expectancy
0  Afghanistan  AFG  1950           27.638
1  Afghanistan  AFG  1951           27.878
2  Afghanistan  AFG  1952           28.361
3  Afghanistan  AFG  1953           28.852
4  Afghanistan  AFG  1954           29.350

In [12]:
life_expectency['Year'].max()

2019

In [13]:
# Obtaining the latest data
life_expectency1 = life_expectency[life_expectency['Year']==2019]
life_expectency1

               Entity      Code  Year  Life expectancy
69        Afghanistan       AFG  2019           64.833
141            Africa       NaN  2019           63.170
211           Albania       ALB  2019           78.573
284           Algeria       DZA  2019           76.880
354    American Samoa       ASM  2019           73.745
...               ...       ...   ...              ...
18740  Western Sahara       ESH  2019           70.263
18817           World  OWID_WRL  2019           72.584
18887           Yemen       YEM  2019           66.125
18957          Zambia       ZMB  2019           63.886
19027        Zimbabwe       ZWE  2019           61.490

[243 rows x 4 columns]

In [14]:
life_expectency2 = life_expectency1.drop(columns=['Code', 'Year'])
life_expectency2

               Entity  Life expectancy
69        Afghanistan           64.833
141            Africa           63.170
211           Albania           78.573
284           Algeria           76.880
354    American Samoa           73.745
...               ...              ...
18740  Western Sahara           70.263
18817           World           72.584
18887           Yemen           66.125
18957          Zambia           63.886
19027        Zimbabwe           61.490

[243 rows x 2 columns]

In [15]:
# Population Data by Country
population

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
0,Afghanistan,AFG,1800,3280000
1,Afghanistan,AFG,1801,3280000
2,Afghanistan,AFG,1802,3280000
3,Afghanistan,AFG,1803,3280000
4,Afghanistan,AFG,1804,3280000
...,...,...,...,...
66480,Zimbabwe,ZWE,2096,30941000
66481,Zimbabwe,ZWE,2097,30952000
66482,Zimbabwe,ZWE,2098,30960000
66483,Zimbabwe,ZWE,2099,30964000
66484,Zimbabwe,ZWE,2100,30965000

In [16]:
# Latest year
population['Year'].max()

2100

In [17]:
# Obtaining Population as of 2019
population1 = population[population['Year']==2019]
population1

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
219,Afghanistan,AFG,2019,38042000
422,Africa,NaN,2019,1308064000
723,Albania,ALB,2019,2881000
1024,Algeria,DZA,2019,43053000
1175,American Samoa,ASM,2019,55000
...,...,...,...,...
65268,Western Sahara,ESH,2019,582000
65500,World,OWID_WRL,2019,7713468000
65801,Yemen,YEM,2019,29162000
66102,Zambia,ZMB,2019,17861000
66403,Zimbabwe,ZWE,2019,14645000

In [18]:
# Renaming the column
population2 = population1.rename(columns={'Population by country and region, historic and projections (Gapminder, HYDE & UN)': 'Population'})
population2

               Entity      Code  Year  Population
219       Afghanistan       AFG  2019    38042000
422            Africa       NaN  2019  1308064000
723           Albania       ALB  2019     2881000
1024          Algeria       DZA  2019    43053000
1175   American Samoa       ASM  2019       55000
...               ...       ...   ...         ...
65268  Western Sahara       ESH  2019      582000
65500           World  OWID_WRL  2019  7713468000
65801           Yemen       YEM  2019    29162000
66102          Zambia       ZMB  2019    17861000
66403        Zimbabwe       ZWE  2019    14645000

[242 rows x 4 columns]

In [19]:
# Dropping the year and code
population3 = population2.drop(columns=['Year', 'Code'])
population3

               Entity  Population
219       Afghanistan    38042000
422            Africa  1308064000
723           Albania     2881000
1024          Algeria    43053000
1175   American Samoa       55000
...               ...         ...
65268  Western Sahara      582000
65500           World  7713468000
65801           Yemen    29162000
66102          Zambia    17861000
66403        Zimbabwe    14645000

[242 rows x 2 columns]

In [20]:
# Heart Disease Data cleaning
heart_disease.head()

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
0,Afghanistan,AFG,1990,23.707752
1,Afghanistan,AFG,1991,23.490307
2,Afghanistan,AFG,1992,23.146918
3,Afghanistan,AFG,1993,21.154207
4,Afghanistan,AFG,1994,19.756144

In [21]:
heart_disease['Year'].max()

2017

In [22]:
heart_disease1 = heart_disease[heart_disease['Year']==2017]
heart_disease1

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
27,Afghanistan,AFG,2017,24.780577
55,Albania,ALB,2017,55.822085
83,Algeria,DZA,2017,47.284557
111,American Samoa,ASM,2017,30.440218
139,Andean Latin America,NaN,2017,21.193030
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,10.304049
6383,World,OWID_WRL,2017,31.800515
6411,Yemen,YEM,2017,32.373980
6439,Zambia,ZMB,2017,10.277008
6467,Zimbabwe,ZWE,2017,14.430736

In [23]:
heart_disease2 = heart_disease1.drop(columns=['Year', 'Code']).rename(columns={'Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)':'Cardiovascular Deaths %'})
heart_disease2

                          Entity  Cardiovascular Deaths %
27                   Afghanistan                24.780577
55                       Albania                55.822085
83                       Algeria                47.284557
111               American Samoa                30.440218
139         Andean Latin America                21.193030
...                          ...                      ...
6355  Western Sub-Saharan Africa                10.304049
6383                       World                31.800515
6411                       Yemen                32.373980
6439                      Zambia                10.277008
6467                    Zimbabwe                14.430736

[231 rows x 2 columns]

In [24]:
# Tuberculosis Data
tuberculosis.head()

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
0,Afghanistan,AFG,1990,4332.690583
1,Afghanistan,AFG,1991,4288.640464
2,Afghanistan,AFG,1992,4475.257542
3,Afghanistan,AFG,1993,4909.050325
4,Afghanistan,AFG,1994,5352.634058

In [25]:
# Latest year
tuberculosis['Year'].max()

2017

In [26]:
# Filtering based on latest year
tuberculosis1 = tuberculosis[tuberculosis['Year']==2017]
tuberculosis1

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
27,Afghanistan,AFG,2017,3.634061e+03
55,Albania,ALB,2017,1.198700e+01
83,Algeria,DZA,2017,4.170693e+02
111,American Samoa,ASM,2017,3.769006e-01
139,Andean Latin America,NaN,2017,3.884472e+03
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,1.297312e+05
6383,World,OWID_WRL,2017,1.183672e+06
6411,Yemen,YEM,2017,1.021099e+03
6439,Zambia,ZMB,2017,8.306847e+03
6467,Zimbabwe,ZWE,2017,1.195807e+04

In [27]:
# Dropping and renaming the column
tuberculosis2 = tuberculosis1.drop(columns=['Code', 'Year']).rename(columns={'Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)':'TB Deaths'})
tuberculosis2

                          Entity     TB Deaths
27                   Afghanistan  3.634061e+03
55                       Albania  1.198700e+01
83                       Algeria  4.170693e+02
111               American Samoa  3.769006e-01
139         Andean Latin America  3.884472e+03
...                          ...           ...
6355  Western Sub-Saharan Africa  1.297312e+05
6383                       World  1.183672e+06
6411                       Yemen  1.021099e+03
6439                      Zambia  8.306847e+03
6467                    Zimbabwe  1.195807e+04

[231 rows x 2 columns]

In [28]:
# Creating a single CSV File for later visualisation
merged_df = pd.merge(child_mortality2,hiv_deaths3, on='Entity', how='inner')
merged_df

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458
1,Albania,ALB,2016,1.35,1.285800,3.030192
2,Algeria,DZA,2016,2.52,326.660742,900.805751
3,Andorra,AND,2016,0.27,0.441990,4.594938
4,Angola,AGO,2016,8.25,14584.702430,19017.694410
...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980
187,Yemen,YEM,2016,5.53,387.383175,1082.582833
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940

In [29]:
# Merging with Life Expectency Dataframe
merged_df1 = pd.merge(merged_df, life_expectency2, how='inner', on='Entity')
merged_df1

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147
...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490

In [30]:
# Merging with population
merged_df2 = pd.merge(merged_df1,population3, how='inner', on='Entity')
merged_df2

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000
...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000

In [31]:
# Merging with Heart Disease
merged_df3 = pd.merge(merged_df2, heart_disease2, on='Entity', how='inner')
merged_df3

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254
...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736

In [32]:
# Merging with the TB Data
merged_df4 = pd.merge(merged_df3, tuberculosis2, how='inner', on='Entity')
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530
...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530

In [33]:
# Converting percentages to absolute numbers
merged_df4['Child Mortality'] = (merged_df4['Child mortality rates (%)']/100)*merged_df4['Population']
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5
...,...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0

In [36]:
# Converting cardiovascular rates to absolute numbers
merged_df4['Cardiovascular Deaths'] = (merged_df4['Cardiovascular Deaths %']/100) * merged_df4['Population']
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06
...,...,...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06

In [38]:
# Renaming Entity to Country and dropping Year and Code
merged_df6 = merged_df4.drop(columns=['Code', 'Year']).rename(columns={'Entity':'Country'})
merged_df6

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06
...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06
186,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07
187,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06
188,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06
189,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06

In [39]:
# Diabetes dataframe
diabetes = pd.read_csv('Dataset/healthdata/diabetes-prevalence.csv')
diabetes

,Entity,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,AFG,9.59000
1,Albania,ALB,10.08000
2,Algeria,DZA,6.73000
3,Andorra,AND,7.97000
4,Angola,AGO,3.94000
...,...,...,...
248,Vietnam,VNM,6.00000
249,World,OWID_WRL,8.50963
250,Yemen,YEM,5.35000
251,Zambia,ZMB,3.94000
252,Zimbabwe,ZWE,1.82000

In [40]:
diabetes1 = diabetes.rename(columns={'Entity':'Country'})
diabetes1

,Country,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,AFG,9.59000
1,Albania,ALB,10.08000
2,Algeria,DZA,6.73000
3,Andorra,AND,7.97000
4,Angola,AGO,3.94000
...,...,...,...
248,Vietnam,VNM,6.00000
249,World,OWID_WRL,8.50963
250,Yemen,YEM,5.35000
251,Zambia,ZMB,3.94000
252,Zimbabwe,ZWE,1.82000

In [41]:
# Merging the dataframe
merged_df7 = pd.merge(merged_df6, diabetes1, how='inner', on='Country')
merged_df7

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,AFG,9.59
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,ALB,10.08
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,DZA,6.73
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,AND,7.97
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,AGO,3.94
...,...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,VEN,6.47
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,VNM,6.00
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,YEM,5.35
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,ZMB,3.94
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,ZWE,1.82

In [42]:
merged_df8 = merged_df7.drop(columns=['Code']).rename(columns={'Diabetes prevalence (% of population ages 20 to 79)':'Diabetes Incidence'})
merged_df8

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Diabetes Incidence
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,9.59
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,10.08
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,6.73
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,7.97
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,3.94
...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,6.47
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,6.00
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,5.35
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,3.94
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,1.82

In [43]:
merged_df8['Diabetes Rates'] = (merged_df8['Diabetes Incidence']/100)*merged_df8['Population']
merged_df9 = merged_df8.drop(columns=['Diabetes Incidence'])
merged_df9

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Diabetes Rates
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,3648227.8
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,290404.8
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,2897466.9
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,6136.9
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,1253905.0
...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,1844985.2
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,5787720.0
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,1560167.0
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,703723.4
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,266539.0

In [65]:
# Exporting the Dataframe as a cleaned CSV file
merged_df9.to_csv('cleaned_dataset/heatlh_data_by_country.csv', index=False)

In [66]:
# Environment Data
co2_emission = pd.read_csv('Dataset/environmentdata/annual-co2-emissions-per-country.csv')
plastic_waste = pd.read_csv('Dataset/environmentdata/plastic-waste-generation-total.csv')
particulate_pollution = pd.read_csv('Dataset/environmentdata/PM25-air-pollution.csv')
forest_cover = pd.read_csv('Dataset/environmentdata/forest-area-as-share-of-land-area.csv')

In [67]:
forest_cover

           Entity Code  Year  Forest cover
0     Afghanistan  AFG  1990      1.850994
1     Afghanistan  AFG  1991      1.850994
2     Afghanistan  AFG  1992      1.850994
3     Afghanistan  AFG  1993      1.850994
4     Afghanistan  AFG  1994      1.850994
...           ...  ...   ...           ...
7969     Zimbabwe  ZWE  2016     45.570273
7970     Zimbabwe  ZWE  2017     45.451183
7971     Zimbabwe  ZWE  2018     45.332093
7972     Zimbabwe  ZWE  2019     45.213002
7973     Zimbabwe  ZWE  2020     45.093912

[7974 rows x 4 columns]

In [68]:
# Filtering by first and last year of reporting
forest_cover1 = forest_cover[(forest_cover['Year']==1990) | (forest_cover['Year']==2019)]
forest_cover1

           Entity Code  Year  Forest cover
0     Afghanistan  AFG  1990      1.850994
29    Afghanistan  AFG  2019      1.850994
31         Africa  NaN  1990     24.856428
60         Africa  NaN  2019     21.436713
62        Albania  ALB  1990     28.788321
...           ...  ...   ...           ...
7910        Yemen  YEM  2019      1.039832
7912       Zambia  ZMB  1990     63.778098
7941       Zambia  ZMB  2019     60.536521
7943     Zimbabwe  ZWE  1990     48.666615
7972     Zimbabwe  ZWE  2019     45.213002

[488 rows x 4 columns]

In [69]:
# Deforestation Percentage Change
forest_cover1['Deforestation Rate'] = (forest_cover1['Forest cover'].pct_change()) * 100
forest_cover1

           Entity Code  Year  Forest cover  Deforestation Rate
0     Afghanistan  AFG  1990      1.850994                 NaN
29    Afghanistan  AFG  2019      1.850994            0.000000
31         Africa  NaN  1990     24.856428         1242.869136
60         Africa  NaN  2019     21.436713          -13.757870
62        Albania  ALB  1990     28.788321           34.294474
...           ...  ...   ...           ...                 ...
7910        Yemen  YEM  2019      1.039832            0.000000
7912       Zambia  ZMB  1990     63.778098         6033.501310
7941       Zambia  ZMB  2019     60.536521           -5.082587
7943     Zimbabwe  ZWE  1990     48.666615          -19.607842
7972     Zimbabwe  ZWE  2019     45.213002           -7.096472

[488 rows x 5 columns]

In [70]:
# Filtering out deforrestation rates from the dataframe
forest_cover2 = forest_cover1.drop(columns=['Code',	'Forest cover'])
forest_cover2

           Entity  Year  Deforestation Rate
0     Afghanistan  1990                 NaN
29    Afghanistan  2019            0.000000
31         Africa  1990         1242.869136
60         Africa  2019          -13.757870
62        Albania  1990           34.294474
...           ...   ...                 ...
7910        Yemen  2019            0.000000
7912       Zambia  1990         6033.501310
7941       Zambia  2019           -5.082587
7943     Zimbabwe  1990          -19.607842
7972     Zimbabwe  2019           -7.096472

[488 rows x 3 columns]

In [71]:
forest_cover3 = forest_cover2[forest_cover2['Year']==2019]
forest_cover3

              Entity  Year  Deforestation Rate
29       Afghanistan  2019            0.000000
60            Africa  2019          -13.757870
91           Albania  2019            0.019967
122          Algeria  2019           17.000600
153   American Samoa  2019           -5.035971
...              ...   ...                 ...
7848  Western Sahara  2019           -0.015637
7879           World  2019           -4.072102
7910           Yemen  2019            0.000000
7941          Zambia  2019           -5.082587
7972        Zimbabwe  2019           -7.096472

[262 rows x 3 columns]

In [72]:
# Co2 Emission
co2_emission.head()

        Entity Code  Year  Annual CO2 emissions
0  Afghanistan  AFG  1949              0.014656
1  Afghanistan  AFG  1950              0.084272
2  Afghanistan  AFG  1951              0.091600
3  Afghanistan  AFG  1952              0.091600
4  Afghanistan  AFG  1953              0.106256

In [73]:
# Latest year
co2_emission['Year'].max()

2018

In [74]:
co2_emission1 = co2_emission[co2_emission['Year']==2018]
co2_emission1

                          Entity      Code  Year  Annual CO2 emissions
69                   Afghanistan       AFG  2018              9.438789
337                       Africa       NaN  2018           1400.841210
423                      Albania       ALB  2018              4.569964
532                      Algeria       DZA  2018            155.725261
561                      Andorra       AND  2018              0.470909
...                          ...       ...   ...                   ...
22750  Wallis and Futuna Islands       NaN  2018              0.027057
23018                      World  OWID_WRL  2018          36572.754220
23087                      Yemen       YEM  2018             10.140644
23244                     Zambia       ZMB  2018              5.228035
23371                   Zimbabwe       ZWE  2018             12.262698

[233 rows x 4 columns]

In [75]:
co2_emission2 = co2_emission1.rename(columns={'Annual CO2 emissions':'Annual CO2 emissions (ppm)'})
co2_emission2

                          Entity      Code  Year  Annual CO2 emissions (ppm)
69                   Afghanistan       AFG  2018                    9.438789
337                       Africa       NaN  2018                 1400.841210
423                      Albania       ALB  2018                    4.569964
532                      Algeria       DZA  2018                  155.725261
561                      Andorra       AND  2018                    0.470909
...                          ...       ...   ...                         ...
22750  Wallis and Futuna Islands       NaN  2018                    0.027057
23018                      World  OWID_WRL  2018                36572.754220
23087                      Yemen       YEM  2018                   10.140644
23244                     Zambia       ZMB  2018                    5.228035
23371                   Zimbabwe       ZWE  2018                   12.262698

[233 rows x 4 columns]

In [76]:
co2_emission3 = co2_emission2.drop(columns=['Code','Year'])
co2_emission3

                          Entity  Annual CO2 emissions (ppm)
69                   Afghanistan                    9.438789
337                       Africa                 1400.841210
423                      Albania                    4.569964
532                      Algeria                  155.725261
561                      Andorra                    0.470909
...                          ...                         ...
22750  Wallis and Futuna Islands                    0.027057
23018                      World                36572.754220
23087                      Yemen                   10.140644
23244                     Zambia                    5.228035
23371                   Zimbabwe                   12.262698

[233 rows x 2 columns]

In [77]:
# plastic waste generation
plastic_waste

                  Entity Code  Plastic waste generation (tonnes, total)
0                Albania  ALB                                     73364
1                Algeria  DZA                                   1898343
2                 Angola  AGO                                    528843
3    Antigua and Barbuda  ATG                                     22804
4              Argentina  ARG                                   2753550
..                   ...  ...                                       ...
163              Uruguay  URY                                    310379
164              Vanuatu  VUT                                     25443
165            Venezuela  VEN                                   2669998
166              Vietnam  VNM                                   3268227
167                Yemen  YEM                                    887497

[168 rows x 3 columns]

In [78]:
plastic_waste.loc[0] = ['Afghanistan','AFG',112000]

In [79]:
plastic_waste1 = plastic_waste.drop(columns=['Code'])
plastic_waste1

                  Entity  Plastic waste generation (tonnes, total)
0            Afghanistan                                    112000
1                Algeria                                   1898343
2                 Angola                                    528843
3    Antigua and Barbuda                                     22804
4              Argentina                                   2753550
..                   ...                                       ...
163              Uruguay                                    310379
164              Vanuatu                                     25443
165            Venezuela                                   2669998
166              Vietnam                                   3268227
167                Yemen                                    887497

[168 rows x 2 columns]

In [80]:
# Particle pollution
particulate_pollution

,Entity,Code,Year,"PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)"
0,Afghanistan,AFG,1990,60.936690
1,Afghanistan,AFG,1995,56.136628
2,Afghanistan,AFG,2000,56.092028
3,Afghanistan,AFG,2005,43.234032
4,Afghanistan,AFG,2010,46.536809
...,...,...,...,...
2635,Zimbabwe,ZWE,2012,23.359478
2636,Zimbabwe,ZWE,2013,23.448376
2637,Zimbabwe,ZWE,2014,23.072327
2638,Zimbabwe,ZWE,2015,24.371786
2639,Zimbabwe,ZWE,2016,24.513035

In [81]:
# Latest year
particulate_pollution['Year'].max()

2016

In [82]:
particulate_pollution1 = particulate_pollution[particulate_pollution['Year']==2016]
particulate_pollution1

,Entity,Code,Year,"PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)"
10,Afghanistan,AFG,2016,62.854857
21,Albania,ALB,2016,14.634008
32,Algeria,DZA,2016,37.230956
43,American Samoa,ASM,2016,3.763412
54,Andorra,AND,2016,10.879472
...,...,...,...,...
2595,Vietnam,VNM,2016,26.285906
2606,World,OWID_WRL,2016,49.673465
2617,Yemen,YEM,2016,72.553865
2628,Zambia,ZMB,2016,30.550295
2639,Zimbabwe,ZWE,2016,24.513035

In [83]:
particulate_pollution2 = particulate_pollution1.drop(columns=['Code','Year']).rename(columns={'PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)':'PM2.5 air pollution(micrograms per cubic meter)'})
particulate_pollution2

              Entity  PM2.5 air pollution(micrograms per cubic meter)
10       Afghanistan                                        62.854857
21           Albania                                        14.634008
32           Algeria                                        37.230956
43    American Samoa                                         3.763412
54           Andorra                                        10.879472
...              ...                                              ...
2595         Vietnam                                        26.285906
2606           World                                        49.673465
2617           Yemen                                        72.553865
2628          Zambia                                        30.550295
2639        Zimbabwe                                        24.513035

[240 rows x 2 columns]

In [84]:
# Merging the dataframes by country
env_df = pd.merge(co2_emission3, forest_cover3, how='inner',on='Entity')
env_df

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate
0,Afghanistan,9.438789,2019,0.000000
1,Africa,1400.841210,2019,-13.757870
2,Albania,4.569964,2019,0.019967
3,Algeria,155.725261,2019,17.000600
4,Andorra,0.470909,2019,0.000000
...,...,...,...,...
209,Wallis and Futuna Islands,0.027057,2019,0.517241
210,World,36572.754220,2019,-4.072102
211,Yemen,10.140644,2019,0.000000
212,Zambia,5.228035,2019,-5.082587
213,Zimbabwe,12.262698,2019,-7.096472

In [85]:
env_df1 = pd.merge(env_df, plastic_waste1, how='inner', on='Entity')
env_df1

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate,"Plastic waste generation (tonnes, total)"
0,Afghanistan,9.438789,2019,0.000000,112000
1,Algeria,155.725261,2019,17.000600,1898343
2,Angola,34.537201,2019,-15.266103,528843
3,Antigua and Barbuda,0.565835,2019,-19.030663,22804
4,Argentina,195.531412,2019,-18.538234,2753550
...,...,...,...,...,...
150,Uruguay,6.943860,2019,151.729323,310379
151,Vanuatu,0.154614,2019,0.000000,25443
152,Venezuela,138.764602,2019,-10.965056,2669998
153,Vietnam,206.660895,2019,54.937137,3268227
154,Yemen,10.140644,2019,0.000000,887497

In [88]:
env_df2 = pd.merge(env_df1, particulate_pollution2, how='inner',on='Entity')
env_df2

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate,"Plastic waste generation (tonnes, total)",PM2.5 air pollution(micrograms per cubic meter)
0,Afghanistan,9.438789,2019,0.000000,112000,62.854857
1,Algeria,155.725261,2019,17.000600,1898343,37.230956
2,Angola,34.537201,2019,-15.266103,528843,36.240479
3,Antigua and Barbuda,0.565835,2019,-19.030663,22804,15.685943
4,Argentina,195.531412,2019,-18.538234,2753550,14.148167
...,...,...,...,...,...,...
139,Uruguay,6.943860,2019,151.729323,310379,11.523398
140,Vanuatu,0.154614,2019,0.000000,25443,8.848735
141,Venezuela,138.764602,2019,-10.965056,2669998,26.331181
142,Vietnam,206.660895,2019,54.937137,3268227,26.285906
143,Yemen,10.140644,2019,0.000000,887497,72.553865